app/controllers/api/v1/activities_controller.rb

SELECT "activities".* FROM "activities" ORDER BY "activities"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 200], ["OFFSET", 0]]
---
      def index
        activities = Activity.includes(:contact, :deal, :user)
                             .filter_type(params[:activity_type])
                             .filter_contact(params[:contact_id])
                             .filter_deal(params[:deal_id])
                             .order(created_at: :desc)
                             .page(params[:page]).per(params[:per_page] || 30)

UPDATE "activities" SET "completed" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["completed", 1], ["updated_at", "2026-03-28 16:21:04.728780"], ["id", 2]]
---
      def update
        activity = find_activity
        activity.update!(activity_params)

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      def find_activity
        Activity.find(params[:id])