app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "role", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def signup
        user = User.create!(signup_params)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@crm.com"], ["LIMIT", 1]]
---
      def login
        user = User.find_by!(email: params[:email].to_s.downcase)