app/controllers/api/v1/companies_controller.rb

      def index
        companies = Company.search(params[:q])
                           .order(name: :asc)
                           .page(params[:page]).per(params[:per_page] || 20)
---
SELECT "companies".* FROM "companies" ORDER BY "companies"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 100], ["OFFSET", 0]]

      def create
        company = Company.create!(company_params)
---
INSERT INTO "companies" ("name", "industry", "website", "phone", "address", "city", "country", "size", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

      def find_company
        Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ?  [["id", 1]]