app/controllers/api/v1/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."status" = ? ORDER BY "contacts"."created_at" DESC LIMIT ? OFFSET ?  [["status", 0], ["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."company_id" = ?  [["company_id", 1]]
---
      def index
        contacts = Contact.includes(:company)
                          .search(params[:q])
                          .filter_status(params[:status])
                          .order(created_at: :desc)
                          .page(params[:page]).per(params[:per_page] || 20)

INSERT INTO "contacts" ("first_name", "last_name", "email", "phone", "job_title", "status", "source", "notes", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def create
        contact = Contact.create!(contact_params)