app/controllers/api/v1/deals_controller.rb

      def index
        deals = Deal.includes(:contact, :company, :owner)
                    .filter_stage(params[:stage])
                    .filter_owner(params[:owner_id])
                    .order(created_at: :desc)
                    .page(params[:page]).per(params[:per_page] || 20)
---
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 200], ["OFFSET", 0]]
SELECT "deals".* FROM "deals" ORDER BY "deals"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 200], ["OFFSET", 0]]
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."company_id" = ?  [["company_id", 1]]
SELECT COUNT(*) FROM "deals" WHERE "deals"."stage" = ?  [["stage", "prospecting"]]

      def create
        deal = Deal.create!(deal_params.merge(owner_id: current_user.id))
---
INSERT INTO "deals" ("title", "value", "stage", "probability", "expected_close_date", "notes", "contact_id", "company_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

      def update_stage
        deal = find_deal
        stage = params[:stage].to_s

        return json_response({ error: "Invalid stage", valid_stages: STAGES }, :unprocessable_entity) unless STAGES.include?(stage)

        deal.update!(stage: stage)
        deal.activities.create!(
          activity_type: "stage_change",
          subject:       "Stage updated to: #{stage.humanize}",
          user:          current_user
        )
---
UPDATE "deals" SET "stage" = ?, "updated_at" = ? WHERE "deals"."id" = ?  [["stage", "proposal"], ["updated_at", "2026-03-28 16:20:50.355805"], ["id", 1]]
INSERT INTO "activities" ("activity_type", "subject", "description", "completed", "scheduled_at", "user_id", "contact_id", "deal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

      def find_deal
        Deal.find(params[:id])
---
SELECT "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]